{
  "apps": [
    { "Name": "aria2", "Source": "main" },
    { "Name": "CascadiaCode-NF", "Source": "nerd-fonts" },
    { "Name": "docker-compose", "Source": "main" },
    { "Name": "exiftool", "Source": "main" },
    { "Name": "FiraCode-NF", "Source": "nerd-fonts" },
    { "Name": "FiraCode", "Source": "nerd-fonts" },
    { "Name": "FiraMono-NF", "Source": "nerd-fonts" },
    { "Name": "gh", "Source": "main" },
    { "Name": "gifski", "Source": "main" },
    { "Name": "godot-mono", "Source": "extras" },
    { "Name": "Hermit-NF", "Source": "nerd-fonts" },
    { "Name": "jdupes", "Source": "main" },
    { "Name": "JetBrains-Mono", "Source": "nerd-fonts" },
    { "Name": "JetBrainsMono-NF", "Source": "nerd-fonts" },
    { "Name": "less", "Source": "main" },
    { "Name": "lime3ds", "Source": "games" },
    { "Name": "luarocks", "Source": "main" },
    { "Name": "mise", "Source": "main" },
    { "Name": "Monaspace-NF", "Source": "nerd-fonts" },
    { "Name": "Monaspace", "Source": "nerd-fonts" },
    { "Name": "msys2", "Source": "main" },
    { "Name": "neovim", "Source": "main" },
    { "Name": "oh-my-posh", "Source": "main" },
    { "Name": "processhacker", "Source": "extras" },
    { "Name": "regeditor", "Source": "extras" },
    { "Name": "ruffle-nightly", "Source": "versions" },
    { "Name": "scoop-completion", "Source": "extras" },
    { "Name": "scoop-search", "Source": "main" },
    { "Name": "shutup10", "Source": "extras" },
    { "Name": "starship", "Source": "main" },
    { "Name": "steam-rom-manager", "Source": "games" },
    { "Name": "tree-sitter", "Source": "main" },
    { "Name": "uutils-coreutils", "Source": "main" },
    { "Name": "winget-ps", "Source": "main" }
  ],
  "buckets": [
    { "Name": "main" },
    { "Name": "extras" },
    { "Name": "versions" },
    { "Name": "games" },
    { "Name": "nerd-fonts" }
  ]
}
