{
  "apps": [
    { "Name": "1password-cli", "Source": "main" },
    { "Name": "age", "Source": "extras" },
    { "Name": "aria2", "Source": "main" },
    { "Name": "bat", "Source": "main" },
    { "Name": "carapace-bin", "Source": "extras" },
    { "Name": "CascadiaCode-NF", "Source": "nerd-fonts" },
    { "Name": "chezmoi", "Source": "main" },
    { "Name": "curl", "Source": "main" },
    { "Name": "docker-compose", "Source": "main" },
    { "Name": "doggo", "Source": "main" },
    { "Name": "exercism", "Source": "main" },
    { "Name": "exiftool", "Source": "main" },
    { "Name": "eza", "Source": "main" },
    { "Name": "fastfetch", "Source": "main" },
    { "Name": "ffmpeg", "Source": "main" },
    { "Name": "FiraCode-NF", "Source": "nerd-fonts" },
    { "Name": "FiraCode", "Source": "nerd-fonts" },
    { "Name": "FiraMono-NF", "Source": "nerd-fonts" },
    { "Name": "fossil", "Source": "main" },
    { "Name": "fzf", "Source": "main" },
    { "Name": "gallery-dl", "Source": "main" },
    { "Name": "gh", "Source": "main" },
    { "Name": "gifski", "Source": "main" },
    { "Name": "godot-mono", "Source": "extras" },
    { "Name": "Hermit-NF", "Source": "nerd-fonts" },
    { "Name": "jdupes", "Source": "main" },
    { "Name": "JetBrains-Mono", "Source": "nerd-fonts" },
    { "Name": "JetBrainsMono-NF", "Source": "nerd-fonts" },
    { "Name": "jq", "Source": "main" },
    { "Name": "less", "Source": "main" },
    { "Name": "lime3ds", "Source": "games" },
    { "Name": "luarocks", "Source": "main" },
    { "Name": "mercurial", "Source": "main" },
    { "Name": "mise", "Source": "main" },
    { "Name": "Monaspace-NF", "Source": "nerd-fonts" },
    { "Name": "Monaspace", "Source": "nerd-fonts" },
    { "Name": "msys2", "Source": "main" },
    { "Name": "neovim", "Source": "main" },
    { "Name": "oh-my-posh", "Source": "main" },
    { "Name": "processhacker", "Source": "extras" },
    { "Name": "rclone", "Source": "main" },
    { "Name": "regeditor", "Source": "extras" },
    { "Name": "ruffle-nightly", "Source": "versions" },
    { "Name": "scoop-completion", "Source": "extras" },
    { "Name": "scoop-search", "Source": "main" },
    { "Name": "shutup10", "Source": "extras" },
    { "Name": "starship", "Source": "main" },
    { "Name": "steam-rom-manager", "Source": "games" },
    { "Name": "tree-sitter", "Source": "main" },
    { "Name": "uutils-coreutils", "Source": "main" },
    { "Name": "winget-ps", "Source": "main" },
    { "Name": "yt-dlp", "Source": "main" },
    { "Name": "zoxide", "Source": "main" }
  ],
  "buckets": [
    { "Name": "main" },
    { "Name": "extras" },
    { "Name": "versions" },
    { "Name": "games" },
    { "Name": "nerd-fonts" },
    { "Name": "xrtools", "Source": "https://github.com/babo4d/scoop-xrtools" }
  ]
}
