{
  "$schema": "https://aka.ms/winget-packages.schema.2.0.json",
  "Sources": [
    {
      "Packages": [
        { "PackageIdentifier": "AgileBits.1Password.CLI" },
        { "PackageIdentifier": "AgileBits.1Password", "Scope": "user" },
        { "PackageIdentifier": "ajeetdsouza.zoxide" },
        { "PackageIdentifier": "anatawa12.ALCOM" },
        { "PackageIdentifier": "anatawa12.vrc-get" },
        { "PackageIdentifier": "Appest.TickTick" },
        { "PackageIdentifier": "Apple.Bonjour" },
        { "PackageIdentifier": "BurntSushi.ripgrep.MSVC" },
        { "PackageIdentifier": "CPUID.CPU-Z" },
        { "PackageIdentifier": "dandavison.delta" },
        { "PackageIdentifier": "ebkr.r2modman", "Scope": "user" },
        { "PackageIdentifier": "elves.elvish" },
        { "PackageIdentifier": "EpicGames.EpicGamesLauncher" },
        { "PackageIdentifier": "Exercism.CLI" },
        { "PackageIdentifier": "eza-community.eza" },
        { "PackageIdentifier": "f3d-app.f3d" },
        { "PackageIdentifier": "Fastfetch-cli.Fastfetch" },
        { "PackageIdentifier": "filips.FirefoxPWA" },
        { "PackageIdentifier": "FiloSottile.age" },
        { "PackageIdentifier": "Fossil.Fossil" },
        { "PackageIdentifier": "Git.Git", "Scope": "machine" },
        { "PackageIdentifier": "goatcorp.XIVLauncher" },
        { "PackageIdentifier": "HandBrake.HandBrake" },
        { "PackageIdentifier": "ImageMagick.Q16-HDRI" },
        { "PackageIdentifier": "Intel.PresentMon" },
        { "PackageIdentifier": "ItchIo.Itch" },
        { "PackageIdentifier": "JetBrains.Toolbox" },
        { "PackageIdentifier": "Klocman.BulkCrapUninstaller" },
        { "PackageIdentifier": "LizardByte.Sunshine" },
        { "PackageIdentifier": "Logitech.LogiBolt" },
        { "PackageIdentifier": "M2Team.NanaZip" },
        { "PackageIdentifier": "MartiCliment.UniGetUI", "Scope": "machine" },
        { "PackageIdentifier": "MicaForEveryone.MicaForEveryone" },
        { "PackageIdentifier": "Microsoft.Office" },
        { "PackageIdentifier": "Microsoft.PowerToys", "Scope": "user" },
        { "PackageIdentifier": "Microsoft.VisualStudio.2022.Community" },
        { "PackageIdentifier": "Microsoft.VisualStudioCode", "Scope": "user" },
        { "PackageIdentifier": "Microsoft.WingetCreate", "Scope": "user" },
        { "PackageIdentifier": "mikf.gallery-dl" },
        { "PackageIdentifier": "MrKaran.Doggo" },
        { "PackageIdentifier": "Notepad++.Notepad++" },
        { "PackageIdentifier": "Obsidian.Obsidian", "Scope": "user" },
        { "PackageIdentifier": "OBSProject.OBSStudio" },
        { "PackageIdentifier": "OpenWhisperSystems.Signal" },
        { "PackageIdentifier": "PrismLauncher.PrismLauncher", "Scope": "user" },
        { "PackageIdentifier": "qBittorrent.qBittorrent" },
        { "PackageIdentifier": "rcmaehl.MSEdgeRedirect" },
        { "PackageIdentifier": "RedHat.Podman-Desktop", "Scope": "user" },
        { "PackageIdentifier": "RedHat.Podman", "Scope": "machine" },
        { "PackageIdentifier": "rsteube.Carapace" },
        { "PackageIdentifier": "Sandboxie.Plus" },
        { "PackageIdentifier": "sharkdp.fd" },
        { "PackageIdentifier": "sharkdp.hexyl" },
        { "PackageIdentifier": "sharkdp.hyperfine" },
        { "PackageIdentifier": "smartfrigde.Legcord" },
        { "PackageIdentifier": "Tailscale.Tailscale" },
        { "PackageIdentifier": "tbillington.kondo" },
        { "PackageIdentifier": "TechPowerUp.GPU-Z" },
        { "PackageIdentifier": "Unity.UnityHub" },
        { "PackageIdentifier": "Valve.Steam" },
        { "PackageIdentifier": "VideoLAN.VLC" },
        { "PackageIdentifier": "ViGEm.ViGEmBus" },
        { "PackageIdentifier": "VRChat.CreatorCompanion", "Scope": "user" },
        { "PackageIdentifier": "VRCX.VRCX", "Scope": "machine" },
        { "PackageIdentifier": "XAMPPRocky.Tokei" }
      ],
      "SourceDetails": {
        "Argument": "https://cdn.winget.microsoft.com/cache",
        "Identifier": "Microsoft.Winget.Source_8wekyb3d8bbwe",
        "Name": "winget",
        "Type": "Microsoft.PreIndexed.Package"
      }
    },
    {
      "Packages": [
        { "PackageIdentifier": "9MV8F79FGXTR" },
        { "PackageIdentifier": "9MVZQVXJBQ9V" },
        { "PackageIdentifier": "9N2D0P16C80H" },
        { "PackageIdentifier": "9N41MSQ1WNM8" },
        { "PackageIdentifier": "9N4D0MSMP0PT" },
        { "PackageIdentifier": "9N5TDP8VCMHS" },
        { "PackageIdentifier": "9N93MRMSXBF0" },
        { "PackageIdentifier": "9N95Q1ZZPMH4" },
        { "PackageIdentifier": "9NB9M5KZ8SLX" },
        { "PackageIdentifier": "9NBLGGH4Z1SP" },
        { "PackageIdentifier": "9NCTDW2W1BH8" },
        { "PackageIdentifier": "9NCTJ2CQWXV0" },
        { "PackageIdentifier": "9NFNG39387K0" },
        { "PackageIdentifier": "9NJ9Q3JR29L2" },
        { "PackageIdentifier": "9NTV2DZ11KD9" },
        { "PackageIdentifier": "9NW1B444LDLW" },
        { "PackageIdentifier": "9NWMW7BB59HW" },
        { "PackageIdentifier": "9NZCC27PR6N6" },
        { "PackageIdentifier": "9NZVDKPMR9RD" },
        { "PackageIdentifier": "9P3XF8KJ0LSM" },
        { "PackageIdentifier": "9P7KNL5RWT25" },
        { "PackageIdentifier": "9P8DVF1XW02V" },
        { "PackageIdentifier": "9PB51GM7M33J" },
        { "PackageIdentifier": "9PC3H3V7Q9CH" },
        { "PackageIdentifier": "9PD5F2D90LS5" },
        { "PackageIdentifier": "9PD9BHGLFC7H" },
        { "PackageIdentifier": "9PF6NVNS3F0P" },
        { "PackageIdentifier": "9PFXCD722M2C" },
        { "PackageIdentifier": "9PG2DK419DRG" },
        { "PackageIdentifier": "9PJZ3BTL5PV6" },
        { "PackageIdentifier": "9PM5VM1S3VMQ" },
        { "PackageIdentifier": "9PMMSR1CGPWG" },
        { "PackageIdentifier": "9PNSJCLXDZ0V" },
        { "PackageIdentifier": "9PP3C07GTVRH" },
        { "PackageIdentifier": "9WZDNCRDK3WP" },
        { "PackageIdentifier": "9WZDNCRFHVN5" },
        { "PackageIdentifier": "9WZDNCRFHWKN" },
        { "PackageIdentifier": "9WZDNCRFJ3PR" },
        { "PackageIdentifier": "9WZDNCRFJ3PT" },
        { "PackageIdentifier": "9WZDNCRFJBBG" }
      ],
      "SourceDetails": {
        "Argument": "https://storeedgefd.dsx.mp.microsoft.com/v9.0",
        "Identifier": "StoreEdgeFD",
        "Name": "msstore",
        "Type": "Microsoft.Rest"
      }
    }
  ]
}
