{
  "$schema": "https://aka.ms/winget-packages.schema.2.0.json",
  "Sources": [
    {
      "Packages": [
        { "PackageIdentifier": "AgileBits.1Password.CLI" },
        { "PackageIdentifier": "AgileBits.1Password" },
        { "PackageIdentifier": "ajeetdsouza.zoxide" },
        { "PackageIdentifier": "anatawa12.ALCOM" },
        { "PackageIdentifier": "anatawa12.vrc-get" },
        { "PackageIdentifier": "Appest.TickTick" },
        { "PackageIdentifier": "Apple.Bonjour" },
        { "PackageIdentifier": "BurntSushi.ripgrep.MSVC" },
        { "PackageIdentifier": "CPUID.CPU-Z" },
        { "PackageIdentifier": "cURL.cURL" },
        { "PackageIdentifier": "dandavison.delta" },
        { "PackageIdentifier": "Docker.DockerCompose" },
        { "PackageIdentifier": "ebkr.r2modman", "Scope": "user" },
        { "PackageIdentifier": "elves.elvish" },
        { "PackageIdentifier": "EpicGames.EpicGamesLauncher" },
        { "PackageIdentifier": "Exercism.CLI" },
        { "PackageIdentifier": "eza-community.eza" },
        { "PackageIdentifier": "f3d-app.f3d" },
        { "PackageIdentifier": "Fastfetch-cli.Fastfetch" },
        { "PackageIdentifier": "filips.FirefoxPWA" },
        { "PackageIdentifier": "FiloSottile.age" },
        { "PackageIdentifier": "Fossil.Fossil" },
        { "PackageIdentifier": "Git.Git", "Scope": "machine" },
        { "PackageIdentifier": "goatcorp.XIVLauncher" },
        { "PackageIdentifier": "Gyan.FFmpeg" },
        { "PackageIdentifier": "HandBrake.HandBrake" },
        { "PackageIdentifier": "ImageMagick.Q16-HDRI" },
        { "PackageIdentifier": "ItchIo.Itch" },
        { "PackageIdentifier": "JetBrains.Toolbox" },
        { "PackageIdentifier": "jdx.mise" },
        { "PackageIdentifier": "jftuga.less" },
        { "PackageIdentifier": "jqlang.jq" },
        { "PackageIdentifier": "junegunn.fzf" },
        { "PackageIdentifier": "Klocman.BulkCrapUninstaller" },
        { "PackageIdentifier": "LizardByte.Sunshine" },
        { "PackageIdentifier": "Logitech.LogiBolt" },
        { "PackageIdentifier": "M2Team.NanaZip" },
        { "PackageIdentifier": "MartiCliment.UniGetUI", "Scope": "machine" },
        { "PackageIdentifier": "Mercurial.Mercurial" },
        { "PackageIdentifier": "MicaForEveryone.MicaForEveryone" },
        { "PackageIdentifier": "Microsoft.Office" },
        { "PackageIdentifier": "Microsoft.PowerToys", "Scope": "user" },
        { "PackageIdentifier": "Microsoft.VisualStudio.2022.Community" },
        { "PackageIdentifier": "Microsoft.WingetCreate", "Scope": "user" },
        { "PackageIdentifier": "MrKaran.Doggo" },
        { "PackageIdentifier": "Notepad++.Notepad++" },
        { "PackageIdentifier": "Obsidian.Obsidian", "Scope": "user" },
        { "PackageIdentifier": "OBSProject.OBSStudio" },
        { "PackageIdentifier": "OpenWhisperSystems.Signal" },
        { "PackageIdentifier": "PrismLauncher.PrismLauncher", "Scope": "user" },
        { "PackageIdentifier": "qBittorrent.qBittorrent" },
        { "PackageIdentifier": "Rclone.Rclone" },
        { "PackageIdentifier": "rcmaehl.MSEdgeRedirect" },
        { "PackageIdentifier": "RedHat.Podman-Desktop", "Scope": "user" },
        { "PackageIdentifier": "RedHat.Podman", "Scope": "machine" },
        { "PackageIdentifier": "rsteube.Carapace" },
        { "PackageIdentifier": "Sandboxie.Plus" },
        { "PackageIdentifier": "sharkdp.bat" },
        { "PackageIdentifier": "sharkdp.fd" },
        { "PackageIdentifier": "sharkdp.hexyl" },
        { "PackageIdentifier": "sharkdp.hyperfine" },
        { "PackageIdentifier": "smartfrigde.Legcord" },
        { "PackageIdentifier": "Starship.Starship", "Scope": "user" },
        { "PackageIdentifier": "Tailscale.Tailscale" },
        { "PackageIdentifier": "tbillington.kondo" },
        { "PackageIdentifier": "TechPowerUp.GPU-Z" },
        { "PackageIdentifier": "tldr-pages.tlrc" },
        { "PackageIdentifier": "twpayne.chezmoi" },
        { "PackageIdentifier": "Unity.UnityHub" },
        { "PackageIdentifier": "Valve.Steam" },
        { "PackageIdentifier": "VideoLAN.VLC" },
        { "PackageIdentifier": "ViGEm.ViGEmBus" },
        { "PackageIdentifier": "VRChat.CreatorCompanion", "Scope": "user" },
        { "PackageIdentifier": "VRCX.VRCX", "Scope": "machine" },
        { "PackageIdentifier": "XAMPPRocky.Tokei" },
        { "PackageIdentifier": "yt-dlp.yt-dlp" }
      ],
      "SourceDetails": {
        "Argument": "https://cdn.winget.microsoft.com/cache",
        "Identifier": "Microsoft.Winget.Source_8wekyb3d8bbwe",
        "Name": "winget",
        "Type": "Microsoft.PreIndexed.Package"
      }
    }
  ]
}
