# Taps
tap "homebrew/autoupdate" if OS.mac?
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/command-not-found" if OS.mac?
tap "homebrew/services"
tap "buo/cask-upgrade" if OS.mac?
tap "powershell/tap" if OS.mac?
tap "aquaproj/aqua"

# Packages
brew "age" if OS.mac? # encryption tool
brew "age-plugin-yubikey" if OS.mac?
brew "ansible" if OS.mac?
brew "ansible-lint" if OS.mac?
brew "as-tree"
brew "asitop" if OS.mac? && Hardware::CPU.arm? # Apple Silicon performance monitor
brew "atuin" # history sync
brew "b3sum" if OS.mac? # checksum tool, also in Fedora repos
brew "bash-completion" if OS.mac?
brew "bat" if OS.mac? # cat alternative
brew "bingrep"
brew "binwalk" if OS.mac?
brew "bkt" # CLI output caching tool
brew "blueutil" if OS.mac? # bluetooth util, used by a raycast extension
brew "bottom" # system monitor
brew "breezy" if OS.mac?
brew "btop" if OS.mac? # htop alternative
brew "bzip3" if OS.mac? # compression tool, also in Fedora repos
brew "carapace" # completions
brew "chezmoi" if OS.mac?
brew "cloudflared" if OS.mac?
brew "colima" if OS.mac? # Container runtime
brew "cosign"
brew "dark-mode" if OS.mac? # macOS dark mode toggle
brew "ddgr" if OS.mac? # DuckDuckGo search
brew "detect-secrets" if OS.mac?
brew "devcontainer" if OS.mac? # VSCode devcontainers
brew "docker-compose" if OS.mac?
brew "doggo" # DNS lookup tool
brew "dotnet", link: true if OS.mac?
brew "dua-cli" if OS.mac? # disk usage
brew "duf" if OS.mac? # disk usage
brew "dust" # du alternative
brew "elvish" if OS.mac?
brew "exercism" if OS.mac?
brew "exiftool" if OS.mac?
brew "eza" if OS.mac? # ls alternative
brew "fastfetch" if OS.mac? # better neofetch
brew "fd" if OS.mac? # find alternative
brew "ffmpeg" if OS.mac?
brew "fish" if OS.mac?
brew "fossil" if OS.mac? # version control
brew "fx" if OS.mac? # JSON viewer
brew "fzf" if OS.mac?
brew "gallery-dl" if OS.mac?
brew "gawk" if OS.mac?
brew "gh" # GitHub CLI
brew "git" if OS.mac?
brew "git-delta" if OS.mac?
brew "git-lfs" if OS.mac?
brew "git-open" if OS.mac? # Broken on linux
brew "git-remote-hg" if OS.mac?
brew "gitlint" if OS.mac?
brew "gitsign"
brew "glow" # markdown reader
brew "gnupg" if OS.mac?
brew "grc" if OS.mac? # CLI output colorizer
brew "grex" if OS.mac? # regex generator
brew "helm" if OS.mac?
brew "hexyl" if OS.mac? # hex viewer
brew "htop" if OS.mac?
brew "httpie" if OS.mac?
brew "hyperfine" if OS.mac? # benchmarking tool
brew "imagemagick" if OS.mac?
brew "iproute2mac" if OS.mac?
brew "jc" if OS.mac? # JSON parser for various CLIs
brew "jdupes" if OS.mac? # duplicate file finder
brew "jq" if OS.mac? # JSON manipulator
brew "kind" if OS.mac? # Kubernetes in Docker
brew "kondo" # Disk cleanup tool for coding
brew "lazygit" if OS.mac? # Git terminal UI
brew "less" if OS.mac? # Mac OS has an ancient version of Less
brew "lima" if OS.mac? # Linux VM manager
brew "litecli" if OS.mac? # SQLite client
brew "lnav" if OS.mac? # log file viewer
brew "luarocks" if OS.mac?
brew "m-cli" if OS.mac? # macOS utils
brew "macos-trash" if OS.mac? # trash CLI
brew "mas" if OS.mac? # Mac App Store CLI
brew "mercurial" if OS.mac? # version control
brew "microsocks" if OS.linux? # SOCKS5 proxy
brew "minikube" if OS.mac?
brew "miniserve" # file server
brew "mise" if OS.mac? # really good version manager
brew "most" if OS.mac? # another pager, handles manpages well
brew "neovim" if OS.mac?
brew "npm-check-updates" if OS.mac?
brew "nushell" if OS.mac?
brew "oh-my-posh"
brew "openjdk" if OS.mac?
brew "pandoc" if OS.mac?
brew "pidof" if OS.mac? # process ID lookup
brew "pigz" if OS.mac? # parallel gzip
brew "podman" if OS.mac?
brew "podman-tui" if OS.mac?
brew "podman-compose" if OS.mac?
brew "qemu" if OS.mac?
brew "rclone" if OS.mac? # cloud storage manager
brew "rename" if OS.mac? # rename files
brew "ripgrep" if OS.mac? # grep alternative
brew "rustup" if OS.mac?
brew "slsa-verifier"
brew "starship" if OS.mac? # prompt for fish & zsh
brew "syncthing" if OS.mac?
brew "texinfo" if OS.mac?
brew "tlrc" # fast tldr page viewer
brew "tokei" if OS.mac? # count lines of code
brew "util-linux" if OS.mac? # subset of the util-linux commands for mac OS
brew "uv" if OS.mac? # Python package manager
brew "vhs" if OS.mac? # terminal recorder
brew "viu" # terminal image viewer
brew "vivid" # LS_COLORS generator
brew "watchman" if OS.mac?
brew "whalebrew"
brew "xonsh" if OS.mac?
brew "xz" if OS.mac?
brew "ykman" if OS.mac? # YubiKey manager
brew "yt-dlp" if OS.mac?
brew "yubikey-agent", restart_service: true if OS.mac? # SSH Agent for YubiKeys
brew "zellij" if OS.mac? # tmux alternative
brew "zenith" # Another htop thing
brew "zoxide" if OS.mac? # directory jumping
brew "zstd" if OS.mac?

brew "aquaproj/aqua/aqua"
brew "powershell/tap/powershell", link: true if OS.mac? # PowerShell

cask_args require_sha: true

# Casks
# Check against `ENV["HOMEBREW_CHEZMOI"].nil?` to skip something on chezmoi apply
cask "1password", greedy: true if OS.mac?
cask "1password-cli" if OS.mac?
cask "apparency" if OS.mac? # inspects app bundles + quicklook extension
cask "blender" if OS.mac?
cask "bluebubbles" if OS.mac? # iMessage server
cask "bootstrap-studio" if OS.mac?
cask "dataspell", greedy: ENV["HOMEBREW_CHEZMOI"].nil? if OS.mac?
cask "datagrip", greedy: ENV["HOMEBREW_CHEZMOI"].nil? if OS.mac?
cask "eloston-chromium" if OS.mac? # ungoogled chromium
cask "eul" if OS.mac? # system monitor
cask "figma" if OS.mac? # figma balls
cask "firefox", greedy: true if OS.mac?
cask "font-fira-code" if OS.mac?
cask "font-jetbrains-mono" if OS.mac?
cask "font-monaspace" if OS.mac?
cask "font-symbols-only-nerd-font" if OS.mac?
cask "goland", greedy: ENV["HOMEBREW_CHEZMOI"].nil? if OS.mac?
cask "handbrake" if OS.mac? # encoder
cask "hazeover" if OS.mac? # dims windows that aren't focused
cask "httpie" if OS.mac?
cask "iina" if OS.mac? # video player
cask "intellij-idea", greedy: ENV["HOMEBREW_CHEZMOI"].nil? if OS.mac?
cask "iterm2" if OS.mac? # terminal emulator
cask "jetbrains-toolbox", greedy: true if OS.mac?
cask "kitty" if OS.mac? # terminal emulator
cask "krita" if OS.mac?
cask "menuwhere" if OS.mac? # access menubar via cmd+right click
cask "moonlight" if OS.mac? # local game streaming
cask "obs" if OS.mac? # streaming & recording
cask "obsidian" if OS.mac? # note taking
cask "phpstorm", greedy: ENV["HOMEBREW_CHEZMOI"].nil? if OS.mac?
cask "podman-desktop", greedy: false if OS.mac?
cask "postico" if OS.mac? # postgres client
cask "pycharm", greedy: ENV["HOMEBREW_CHEZMOI"].nil? if OS.mac?
cask "rubymine", greedy: ENV["HOMEBREW_CHEZMOI"].nil? if OS.mac?
cask "signal", greedy: true if OS.mac?
cask "soduto" if OS.mac? # KDE connect for macOS
cask "tor-browser", greedy: true if OS.mac?
cask "tower" if OS.mac? # git client
cask "visual-studio-code" if OS.mac?
cask "vmware-fusion" if OS.mac?
cask "webstorm", greedy: ENV["HOMEBREW_CHEZMOI"].nil? if OS.mac?
cask "whisky" if OS.mac?
cask "zoom", greedy: true if OS.mac?

# as the years go by, i will never die (mac os mitigations)
cask "alt-tab" if OS.mac?
cask "background-music", greedy: ENV["HOMEBREW_CHEZMOI"].nil? if OS.mac? # volume mixer
cask "bettertouchtool", greedy: true if OS.mac? # trackpad settings
cask "karabiner-elements", greedy: ENV["HOMEBREW_CHEZMOI"].nil? if OS.mac? # keyboard remapper
cask "launchpad-manager" if OS.mac?
cask "lulu", greedy: ENV["HOMEBREW_CHEZMOI"].nil? if OS.mac? # firewall
cask "macfuse", greedy: true if OS.mac? # filesystem extender
cask "magicquit" if OS.mac? # quit background apps
cask "raycast", greedy: true if OS.mac? # spotlight replacement
cask "unnaturalscrollwheels" if OS.mac? # reverse scroll direction

mas "Affinity Designer 2", id: 1_616_831_348 if OS.mac?
mas "Affinity Photo 2", id: 1_616_822_987 if OS.mac?
mas "Affinity Publisher 2", id: 1_606_941_598 if OS.mac?
mas "Amphetamine", id: 937_984_704 if OS.mac? # Keep mac awake
mas "BrightIntosh", id: 6_452_471_855 if OS.mac? # Higher brightness
mas "DaVinci Resolve", id: 571_213_070 if OS.mac?
mas "Dropover", id: 1_355_679_052 if OS.mac? # Drag and drop manager
mas "Ivory", id: 6_444_602_274 if OS.mac? # Mastodon client
mas "Keynote", id: 409_183_694 if OS.mac?
mas "Numbers", id: 409_203_825 if OS.mac?
mas "Pages", id: 409_201_541 if OS.mac?
mas "Parcel", id: 639_968_404 if OS.mac? # Package tracker
mas "Shareful", id: 1_522_267_256 if OS.mac?
mas "Slack", id: 803_453_959 if OS.mac?
mas "Tailscale", id: 1_475_387_142 if OS.mac?
mas "TickTick", id: 966_085_870 if OS.mac? # Task manager
mas "Whisper", id: 1_668_083_311 if OS.mac? # Transcription app
mas "Xcode", id: 497_799_835 if OS.mac?
mas "Yubico Authenticator", id: 1_497_506_650 if OS.mac?

# Put at the end of the file because copilot doesn't like profanity lol
brew "thefuck" if OS.mac?
