# Taps
tap "homebrew/autoupdate" if OS.mac?
tap "buo/cask-upgrade" if OS.mac?
tap "gromgit/fuse" if OS.mac?

# Packages
brew "age" if OS.mac? # encryption tool
brew "age-plugin-yubikey" if OS.mac?
brew "ansible" if OS.mac?
brew "ansible-lint" if OS.mac?
brew "as-tree"
brew "atuin" # history sync
brew "aqua" if OS.mac?
brew "b3sum" if OS.mac? # checksum tool, also in Fedora repos
brew "bash-completion" if OS.mac?
brew "bat" if OS.mac? # cat alternative
brew "bingrep"
brew "binwalk" if OS.mac?
brew "bkt" # CLI output caching tool
brew "bottom" # system monitor
brew "breezy" if OS.mac?
brew "btop" if OS.mac? # htop alternative
brew "bzip3" if OS.mac? # compression tool, also in Fedora repos
brew "carapace" # completions
brew "chezmoi" if OS.mac?
brew "cloudflared" if OS.mac?
brew "cosign"
brew "ddgr" if OS.mac? # DuckDuckGo search
brew "detect-secrets" if OS.mac?
brew "devcontainer" if OS.mac? # VSCode devcontainers
brew "docker-compose" if OS.mac?
brew "doggo" # DNS lookup tool
brew "dua-cli" if OS.mac? # disk usage
brew "duf" if OS.mac? # disk usage
brew "dust" # du alternative
brew "elvish" if OS.mac?
brew "exercism" if OS.mac?
brew "exiftool" if OS.mac?
brew "eza" if OS.mac? # ls alternative
brew "fastfetch" if OS.mac? # better neofetch
brew "fd" if OS.mac? # find alternative
brew "fish" if OS.mac?
brew "fossil" if OS.mac? # version control
brew "fx" if OS.mac? # JSON viewer
brew "fzf" if OS.mac?
brew "gallery-dl" if OS.mac?
brew "git" if OS.mac?
brew "git-delta" if OS.mac?
brew "git-lfs" if OS.mac?
brew "git-open" if OS.mac? # Broken on linux
brew "git-remote-hg" if OS.mac?
brew "gitlint" if OS.mac?
brew "gitsign"
brew "glow" # markdown reader
brew "grc" if OS.mac? # CLI output colorizer
brew "grex" if OS.mac? # regex generator
brew "hexyl" if OS.mac? # hex viewer
brew "htop" if OS.mac?
brew "httpie" if OS.mac?
brew "hyperfine" if OS.mac? # benchmarking tool
brew "infat" if OS.mac? # default app management
brew "jc" if OS.mac? # JSON parser for various CLIs
brew "jdupes" if OS.mac? # duplicate file finder
brew "jq" if OS.mac? # JSON manipulator
brew "kondo" # Disk cleanup tool for coding
brew "lazygit" if OS.mac? # Git terminal UI
brew "less" if OS.mac? # Mac OS has an ancient version of Less
brew "lima" if OS.mac? # Linux VM manager
brew "lnav" if OS.mac? # log file viewer
brew "luarocks" if OS.mac?
brew "mas" if OS.mac? # Mac App Store CLI
brew "mercurial" if OS.mac? # version control
brew "microsocks" if OS.linux? # SOCKS5 proxy
brew "miniserve" # file server
brew "mise" if OS.mac? # really good version manager
brew "most" if OS.mac? # another pager, handles manpages well
brew "neovim" if OS.mac?
brew "npm-check-updates" if OS.mac?
brew "oh-my-posh"
brew "openjdk" if OS.mac?
brew "pandoc" if OS.mac?
brew "pigz" if OS.mac? # parallel gzip
brew "podman" if OS.mac?
brew "podman-tui" if OS.mac?
brew "podman-compose" if OS.mac?
brew "rclone" if OS.mac? # cloud storage manager
brew "rename" if OS.mac? # rename files
brew "ripgrep" if OS.mac? # grep alternative
brew "rustup" if OS.mac?
brew "slsa-verifier"
brew "starship" if OS.mac? # prompt for fish & zsh
brew "syncthing" if OS.mac?
brew "texinfo" if OS.mac?
brew "thefuck" if OS.mac?
brew "tlrc" # fast tldr page viewer
brew "tokei" if OS.mac? # count lines of code
brew "uv" if OS.mac? # Python package manager
brew "viu" # terminal image viewer
brew "vivid" # LS_COLORS generator
brew "watchman" if OS.mac?
brew "whalebrew"
brew "xonsh" if OS.mac?
brew "xz" if OS.mac?
brew "ykman" if OS.mac? # YubiKey manager
brew "yt-dlp" if OS.mac?
brew "yubikey-agent", restart_service: true if OS.mac? # SSH Agent for YubiKeys
brew "zellij" if OS.mac? # tmux alternative
brew "zenith" # Another htop thing
brew "zoxide" if OS.mac? # directory jumping

cask_args require_sha: true

# Casks
# Check against `ENV["HOMEBREW_CHEZMOI"].nil?` to skip something on chezmoi apply
cask "1password", greedy: true if OS.mac?
cask "1password-cli" if OS.mac?
cask "android-platform-tools" if OS.mac?
cask "background-music", greedy: ENV["HOMEBREW_CHEZMOI"].nil? if OS.mac? # volume mixer
cask "bluebubbles" if OS.mac? # iMessage server
cask "firefox", greedy: true if OS.mac?
cask "jetbrains-toolbox", greedy: true if OS.mac?
cask "karabiner-elements", greedy: ENV["HOMEBREW_CHEZMOI"].nil? if OS.mac? # keyboard remapper
cask "lulu", greedy: ENV["HOMEBREW_CHEZMOI"].nil? if OS.mac? # firewall
cask "macfuse@dev", greedy: true if OS.mac? # FUSE on Mac OS
cask "podman-desktop", greedy: false if OS.mac?
cask "signal", greedy: true if OS.mac?
cask "tor-browser", greedy: true if OS.mac?
cask "tower" if OS.mac? # git client
cask "ungoogled-chromium" if OS.mac?
cask "zoom", greedy: true if OS.mac?

# Mas isn't really working right now
# mas "Amphetamine", id: 937_984_704 if OS.mac? # Keep mac awake
# mas "BrightIntosh", id: 6_452_471_855 if OS.mac? # Higher brightness
# mas "DaVinci Resolve", id: 571_213_070 if OS.mac?
# mas "Dropover", id: 1_355_679_052 if OS.mac? # Drag and drop manager
# mas "Ivory", id: 6_444_602_274 if OS.mac? # Mastodon client
# mas "Parcel", id: 375_589_283 if OS.mac? # Package tracker
# mas "Shareful", id: 1_522_267_256 if OS.mac?
# mas "Slack", id: 803_453_959 if OS.mac?
# mas "Tailscale", id: 1_475_387_142 if OS.mac?
# mas "TickTick", id: 966_085_870 if OS.mac? # Task manager
# mas "Whisper", id: 1_668_083_311 if OS.mac? # Transcription app
# mas "Xcode", id: 497_799_835 if OS.mac?
# mas "Yubico Authenticator", id: 1_497_506_650 if OS.mac?
